# Groupby
"""
A groupby operation involves some combination of splitting the object,       
applying a function, and combining the results.      
This can be used to group large amounts of data and compute operations on these groups.       
Groupby to perform operations likeSplitting or Aggregations or Fiteration or Transformation.
"""

##### Import required libraries

In [1]:
import pandas as pd

##### Create sample DataFrame

In [2]:
import pandas as pd

ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [3]:
# Get total number of teams in dataset

df.Team.nunique()

5

It indicates that total five teams are playing

In [4]:
# Get names of teams in dataset

df.Team.unique()

array(['MI', 'Devils', 'Kings', 'CSK', 'Royals'], dtype=object)

In [5]:
# Get count of how many matches played by each team

df.Team.value_counts()

MI        4
CSK       3
Devils    2
Royals    2
Kings     1
Name: Team, dtype: int64

It indicates that MI has played 4 matches, CSK has played 3 matches, Royals has played 2 matches, Devils has played 2 matches, and kings has played 1 match.

In [6]:
# Groupby on Team column: It gives summary of each team

df.groupby('Team')

 It gives object. To see contents type cast it in to list

In [7]:
l1 = list(df.groupby('Team'))
l1

[('CSK',
    Team  Rank  Year  Points
  5  CSK     4  2015     812
  6  CSK     1  2016     756
  7  CSK     1  2017     788),
 ('Devils',
       Team  Rank  Year  Points
  2  Devils     2  2014     863
  3  Devils     3  2015     673),
 ('Kings',
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 ('MI',
     Team  Rank  Year  Points
  0    MI     1  2014     876
  1    MI     2  2015     789
  8    MI     2  2016     694
  11   MI     2  2017     690),
 ('Royals',
        Team  Rank  Year  Points
  9   Royals     4  2014     701
  10  Royals     1  2015     804)]

This is in tuple

In [8]:
# Get only team from a tuple

for i in l1:
    print(i[0])

CSK
Devils
Kings
MI
Royals

It can be possible like
for team,data in l1:
    print(team)

In [9]:
# Get records of only MI

df.groupby('Team').get_group('MI')

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

It can be possible like
for team,data in l1:
    if team == 'MI':
        print(data)

In [10]:
# Gate index where team is present

df.groupby('Team').groups

{'CSK': [5, 6, 7], 'Devils': [2, 3], 'Kings': [4], 'MI': [0, 1, 8, 11], 'Royals': [9, 10]}

It indicates that CSK is present at index 5,6,7 like that

In [11]:
# Get year wise average performance

df.groupby('Year').mean()

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

It gives average performance of Rank and Points oly as remaining columns are non-numeric

In [12]:
# Get year wise mean of points only

df.groupby('Year').mean()['Points']

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [13]:
# Get year with minimum average points

df.groupby('Year').mean()['Points'][df.groupby('Year').mean()['Points'].min() == df.groupby('Year').mean()['Points']].index

Int64Index([2016], dtype='int64', name='Year')

In [14]:
# Get yearwise total points

df.groupby('Year').sum()['Points']

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [15]:
# Get only teams with rank 1

df.groupby('Rank').get_group(1)['Team'].tolist()

['MI', 'CSK', 'CSK', 'Royals']

In [16]:
# Get 1st entry of each category according to Team with Rank groupby

df.groupby('Rank').first()

        Team  Year  Points
Rank
1         MI  2014     876
2         MI  2015     789
3     Devils  2015     673
4        CSK  2015     812

In [17]:
# Get last entry of each category according to Team with Rank groupby

df.groupby('Rank').last()

        Team  Year  Points
Rank
1     Royals  2015     804
2         MI  2017     690
3      Kings  2014     741
4     Royals  2014     701

In [18]:
# Get second and third entry of each category according to Team with Rank groupby

for i in list(df.groupby('Rank')):
    print(i[1][1:3])

  Team  Rank  Year  Points
6  CSK     1  2016     756
7  CSK     1  2017     788
     Team  Rank  Year  Points
2  Devils     2  2014     863
8      MI     2  2016     694
    Team  Rank  Year  Points
4  Kings     3  2014     741
     Team  Rank  Year  Points
9  Royals     4  2014     701

In [19]:
# Multiple column groupby

df.groupby(['Team','Year']).groups

{('CSK', 2015): [5], ('CSK', 2016): [6], ('CSK', 2017): [7], ('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('MI', 2014): [0], ('MI', 2015): [1], ('MI', 2016): [8], ('MI', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10]}

It will apply groupby firt on Team and then on year.
It will give index of matched records

In [20]:
# Get records of specific year

df.groupby('Year').get_group(2014)

     Team  Rank  Year  Points
0      MI     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

To get records of specific year using get_groups method